{
    "companies": [
        {
            "id": "2",
            "name": "Sanctuary",
            "slug": "sanctuary",
            "image": "",
            "recruiting": "Yes",
            "region": "NA",
            "faction": "Syndicate",
            "size": "51+",
            "playstyle": "PvX",
            "language": "English",
            "description": "We are a PvX focused Company that is part of the Syndicate Faction and will locate in the NA region. Our Company's success is based on our community and we believe in mutual support and hard work. We operate as a team, use communication and constantly train anyone who needs it. Dedicated to our craft while being driven to be a community-driven company influenced by its members' decisions. We are friendly but we have our sharp edge and thrive to be successful in the world of Aeternum.",
            "featured": "Yes",
            "dateCreated": "Feb 32, 2021"
        },
        {
            "id": "3",
            "name": "Patrons of War",
            "slug": "patrons_of_war",
            "image": "",
            "recruiting": "Yes",
            "region": "NA",
            "faction": "covenant",
            "size": "26-51",
            "playstyle": "PvX",
            "language": "English",
            "description": "Patrons of War is a guild centered around creating exciting events and goals for our community! If you are looking for a guild that is wanting to do all of the content within New World this is the place. We strive to make every member heard and appreciated.",
            "featured": "Yes"
        },
        {
            "id": "4",
            "name": "Elysium",
            "slug": "elysium",
            "image": "",
            "recruiting": "No",
            "region": "NA",
            "faction": "marauders",
            "size": "11-25",
            "playstyle": "PvX",
            "language": "English",
            "description": "We're just a small collection of aimless wanderers at the moment, but we hope to become more organized and goal oriented as the community grows. Feel free to add me on discord (Hexxzn#9785) if you'd like more information. You can also visit our website (https: //elysiumco.shivtr.com) to stay up to date and secure a leadership position by registering before launch.",
            "featured": "No"
        }
    ]
}