{
    "newsfeed": [
        {
            "id": 1,
            "title": "New World June Alpha Update",
            "slug": "new_world_june_alpha_update",
            "date": "June 03, 2021",
            "excerpt": "Amazon Games continues to polish and update New World in preparation for launch.  Today, New World released...",
            "cover_image": "/images/posts/1.jpg",
            "category": "news",
            "author": "Admin",
            "author_image": "",
            "body": "<p class='p-3 tracking-wide text-secondary'>In New World there are 3 main areas in which your character will progress. You gain experience towards your overall character level and will level up once you gain enough XP. Upon leveling up you will be awarded attribute pointsthat can be used to increase one of 5 attributes in the game. You will also gain experience for each weapon type you use in the game, and upon receiving enough experience for a particular weapon you will be awarded with a weapon mastery point to be spent on either an active or passive ability within that weapon's skill trees. The final main progression of your character will come in the form of trade skills. Trade skills consist of gathering, refining, and crafting. </p> <h3 class='text-5xl p-6 font-primary text-secondary'>Core Attributes</h3> <p class='p-3 tracking-wide text-secondary'>As your character levels you will gain attribute points per level up to a total of 190 upon reaching the max character level of 60. You can also gain attribute points from gear. Upon visiting Aeternum for the first time your character will have 5 points in each of the core attributes. You can not drop below that 5 point minimum. </p> <p class='p-3 tracking-wide text-secondary'>The points you earn while leveling your character can then be spent to level up your attributes, and those core attributes ultimately guide your overall build. How you spend those attribute points as you level will be crucial to your success in New World. As mentioned before, New World does not have a class based system so you have to make sure you tie your attribute points into the weapons you are wanting to use. </p> <p class='p-3 tracking-wide text-secondary'>Strength increases the amount of damage you do with melee weapons. Some melee weapons scale exclusively from strength and other, lighter weapons scale primarily from strength and some from dexterity. </p> <p class='p-3 tracking-wide text-secondary'>Dexterity is also the attribute that scales your damage with ranged weapons. </p> <p class='p-3 tracking-wide text-secondary'>Intelligence is the attribute you’ll want to spec into if you’re looking to gain damage from your magical weapons. It’s important to note here and very interesting that intelligence also provides increased damage for your pure magic weapons like the fire staff, and it also provides a damage boost to melee weapons that have a magical enchantment on them like a flaming sword for instance. </p> <p class='p-3 tracking-wide text-secondary'>This isn’t going to increase the base damage of your melee weapon as that’s reserved for strength and dex as mentioned above, but will scale with the enchantment or magical perk that your weapon has.</p> <p class='p-3 tracking-wide text-secondary'>If you’re planning on maining a healer, focus is the attribute you’ll be speccing into. </p> <p class='p-3 tracking-wide text-secondary'>The last attribute is constitution, and it’s pretty straight forward. Putting points into constitution increases your overall health pool making you much tankier.</p> <p class='p-6'>Each attribute also has attribute threshold bonuses. Attribute Threshold Bonuses give a persistent bonus to players for maintaining certain point values in each attribute. Bonuses are awarded every 50 points invested in a single attribute (e.g., at 50, 100, 150 points invested). Each threshold has a combat bonus and a non-combat bonus.</p> <img class='px-0 w-full md:px-6' src='/images/examples/1.jpg' alt='examples'> <h3 class='text-5xl p-6 font-primary text-secondary'>Strength</h3> <ul class='list-disc px-12'> <li>50: +5% damage to melee weapon light attacks, +10% mining speed</li> <li>100: +10% damage to melee weapon heavy attacks, +20 encumbrance</li> <li>150: +50% stamina damage from melee weapon light and heavy attacks, -10% decrease in weight of mined items</li> <li>200: +10% damage on stunned, slowed, or rooted enemies, +10% mining speed</li> <li>250: Stamina regeneration continues while performing light and heavy attacks with melee weapons, +10% yield increase when mining</li> <li>300: Light and heavy attacks with melee weapons gain Grit, 25% chance to fully mine an ore node with a single swing</li> </ul>"
        },
        {
            "id": 2,
            "title": "PvP, Faction and Territory Updates",
            "slug": "pvp_faction_and_territory_updates",
            "date": "April 20, 2021",
            "excerpt": "The April Update has been released and with it a host of new features, like the ice gauntlet, open world territory...",
            "cover_image": "/images/posts/2.jpg",
            "category": "updates",
            "author": "Admin",
            "author_image": "",
            "body": "The April Update has been released and with it a host of new features, like the ice gauntlet, open world territory control points, faction bonuses, two new expeditions, and achievements. Make sure to read the blog post detailing New World's vision for PvP, or read on for the full patch notes."
        },
        {
            "id": 3,
            "title": "New World's March Patch Notes",
            "slug": "new_worlds_march_patch_notes",
            "date": "March 16, 2021",
            "excerpt": "New World just released March's patch notes for the alpha client and they are FULL of new and exciting changes.  These changes include the addition of Ebonscale Reach as a playable zone, the first pass o... ",
            "cover_image": "/images/posts/3.jpg",
            "category": "updates",
            "author": "Admin",
            "author_image": "",
            "body": "New World also made big changes to the way armor and equip load work.  Heavy armor now has the most mitigation of both damage types with light armor being the least in both.  With these changes, they also added damage bonuses to light (20% increased damage) and medium (10%) equip loads to help diversify the benefits of each of the three weights. Included with the rework of all of the Weapon Skill Trees, New World also made changes to the way weapons scale off attribute distribution.  Weapons are now split between single and dual-attribute weapons.  Single attribute weapons scale at 1x to their primary attribute where dual-attribute weapons scale at 0.9x their primary attribute and at 0.65x their secondary stat.  Here is a list of the new changes:"
        },
        {
            "id": 4,
            "title": "Character Progression in New World",
            "slug": "character_progression_in_new_world",
            "date": "May 21, 2021",
            "excerpt": "In New World there are 3 main areas in which your character will progress. You gain experience towards your overall character level and...",
            "cover_image": "/images/posts/4.jpg",
            "category": "guides",
            "author": "Admin",
            "author_image": "",
            "body": "In New World there are 3 main areas in which your character will progress. You gain experience towards your overall character level and will level up once you gain enough XP. Upon leveling up you will be awarded attribute points that can be used to increase one of 5 attributes in the game. You will also gain experience for each weapon type you use in the game, and upon receiving enough experience for a particular weapon you will be awarded with a weapon mastery point to be spent on either an active  or passive ability within that weapon's skill trees. The final main progression of your character will come in the form of trade skills. Trade skills consist of gathering, refining, and crafting."
        },
        {
            "id": 5,
            "title": "New World Release Date Revealed!",
            "slug": "new_world_release_date_revealed!",
            "date": "February 16, 2021",
            "excerpt": "Today, New World officially announced its new release date - August 31st 2021!  Along with the confirmed release date, New World states that they will continue to test ...",
            "cover_image": "/images/posts/5.jpeg",
            "category": "news",
            "author": "Admin",
            "author_image": "",
            "body": "Today, New World officially announced its new release date - August 31st 2021!  Along with the confirmed release date, New World states that they will continue to test in Alpha and expand the test to new EU servers on March 30th 2021.  They also confirmed the next closed Beta Test date, July 20th 2021 stating that if you pre-ordered New World, you'll have access to the Closed Beta Test.  The team continued to confirm they are hard at work on compelling end game features we believe are important to include at launch.  They go on to state that they did not feel that these would be ready by the original May 2021 timeframe they had initially announced, which is why they delayed the official date til August."
        },
        {
            "id": 6,
            "title": "New World Developer Q&A via Discord",
            "slug": "new_world_developer_q&a_via_discord",
            "date": "November 11, 2020",
            "excerpt": "Amazon Games Studio's Community Moderator, Mugsy recently held an impromptu Q&A on the New Worlders Discord Server. Below a... ",
            "cover_image": "/images/posts/6.jpg",
            "category": "updates",
            "author": "Admin",
            "author_image": "",
            "body": "Amazon Games Studio's Community Moderator, Mugsy recently held an impromptu Q&A on the New Worlders Discord Server. Below are the questions asked and the answers provided by Mugsy. We also broke down all of this information and more on the latest episode (episode 40) of New World to Go."
        },
        {
            "id": 7,
            "title": "New World Armor Guide",
            "slug": "new_world_armor_guide",
            "date": "September 28, 2020",
            "excerpt": "Amor in Amazon’s New World MMORPG plays a huge role in how your overall character functions in the game. It doesn’t just provide mitigations, but also de... ",
            "cover_image": "/images/posts/7.jpg",
            "category": "guides",
            "author": "Admin",
            "author_image": "",
            "body": "Amor in Amazon’s New World MMORPG plays a huge role in how your overall character functions in the game. It doesn’t just provide mitigations, but also determines how agile or slow your character becomes during combat. New World has 3 different armor categories, light, medium, and heavy, and you can mix and match pieces of gear in order to obtain your desired build. Armor in New World can also provide your character with special bonuses and additional attribute points through the use of perks and gem slots. "
        },
        {
            "id": 8,
            "title": "How to Fast Travel in New World",
            "slug": "how_to_fast_travel_in_new_world",
            "date": "August 27, 2020",
            "excerpt": "There are no mounts in New World, and it can take quite a bit of time to move around, however,  there are some fast travel options available... ",
            "cover_image": "/images/posts/8.jpg",
            "category": "guides",
            "author": "Admin",
            "author_image": "",
            "body": "There are no mounts in New World, and it can take quite a bit of time to move around, however,  there are some fast travel options available in game. The first option is by traveling to a settlement (not a fort), and visiting the Inn. Once you visit the Inn you can talk with the Innkeeper and receive the option to gain fast travel to that particular settlement. You can only have one Inn active at a time, so if you travel to another settlement and set that settlement as your fast travel location via the Inn option it overrides the previous Inn you had selected."
        },
        {
            "id": 9,
            "title": "New World Beginners guide to Weapons Skill Trees",
            "slug": "new_world_beginners_guide_to_weapons_skill_trees",
            "date": "March 03, 2020",
            "excerpt": "In New World, Progression is linked to each unique weapon as opposed to a specific class.   If you want to level a certa... ",
            "cover_image": "/images/posts/9.png",
            "category": "guides",
            "author": "Admin",
            "author_image": "",
            "body": "In New World, Progression is linked to each unique weapon as opposed to a specific class.   If you want to level a certain Weapon Skill Tree in New World, you simply equip the weapon and go to work!  Here are some quick facts about Weapon Skill Tree's in New World. Max level for each weapon is 20.  As you progress towards the max level of a weapon, you will earn you 19 points to apply between the weapons two skill trees.  During this progression, you will be forced to make choices as each weapon has 38 nodes between the two skill trees with Each tree having 19 nodes.  Its important to note that It takes 10 points to the open up the last node in the tree, only allowing you to access one of the end passives for each weapon."
        },
        {
            "id": 10,
            "title": "Alpha Key Giveaways, New World To Go Podcast discusses Invasions",
            "slug": "alpha_key_giveaways_new_world_to_go_podcast_discusses_invasions",
            "date": "April 22, 2020",
            "excerpt": "The New World To Go podcast has published their 14th episode and this week it's all about Corrupted Invasion... ",
            "cover_image": "/images/posts/10.jpg",
            "category": "news",
            "author": "Admin",
            "author_image": "",
            "body": "The New World To Go podcast has published their 14th episode and this week it's all about Corrupted Invasions. Check out their latest VOD or listen to it on their website or your favorite podcast platform."
        }
    ]
}